lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
constexpr uint8_t securityModeNumber(SecureMode_t mode) {
  return static_cast<uint8_t>(mode) & 0x0FU;
}

constexpr uint8_t securityModeLevel(SecureMode_t mode) {
  return static_cast<uint8_t>(mode) >> 4U;
}

constexpr bool securityModesCanInherit(SecureMode_t characteristic,
                                       SecureMode_t service) {
  return characteristic == SECMODE_NO_ACCESS || service == SECMODE_NO_ACCESS ||
         characteristic == SECMODE_OPEN || service == SECMODE_OPEN ||
         securityModeNumber(characteristic) == securityModeNumber(service);
}

constexpr SecureMode_t inheritServiceSecurity(SecureMode_t characteristic,
                                              SecureMode_t service) {
  if (characteristic == SECMODE_NO_ACCESS || service == SECMODE_NO_ACCESS) {
    return SECMODE_NO_ACCESS;
  }
  if (characteristic == SECMODE_OPEN) {
    return service;
  }
  if (service == SECMODE_OPEN) {
    return characteristic;
  }
  if (securityModeNumber(characteristic) != securityModeNumber(service)) {
    return SECMODE_NO_ACCESS;
  }
  return (securityModeLevel(service) > securityModeLevel(characteristic))
             ? service
             : characteristic;
}

static_assert(inheritServiceSecurity(SECMODE_OPEN, SECMODE_ENC_NO_MITM) ==
                  SECMODE_ENC_NO_MITM,
              "service security must raise an open characteristic");
static_assert(inheritServiceSecurity(SECMODE_ENC_WITH_MITM,
                                     SECMODE_ENC_NO_MITM) ==
                  SECMODE_ENC_WITH_MITM,
              "a stronger characteristic permission must be preserved");
static_assert(inheritServiceSecurity(SECMODE_NO_ACCESS,
                                     SECMODE_ENC_WITH_MITM) ==
                  SECMODE_NO_ACCESS,
              "service inheritance must not open a disabled operation");
static_assert(inheritServiceSecurity(SECMODE_OPEN, SECMODE_NO_ACCESS) ==
                  SECMODE_NO_ACCESS,
              "a disabled service operation must remain disabled");
static_assert(!securityModesCanInherit(SECMODE_SIGNED_NO_MITM,
                                       SECMODE_ENC_WITH_LESC_MITM),
              "signed and encrypted requirements must not be ordered");
static_assert(inheritServiceSecurity(SECMODE_SIGNED_NO_MITM,
                                     SECMODE_ENC_WITH_LESC_MITM) ==
                  SECMODE_NO_ACCESS,
              "incompatible security modes must fail closed");

class ScopedBluefruitUserCallback {
 public:
  ScopedBluefruitUserCallback() { ++depth(); }

  ~ScopedBluefruitUserCallback() {
    if (depth() != 0U) {
      --depth();
    }
  }

  ScopedBluefruitUserCallback(const ScopedBluefruitUserCallback&) = delete;
  ScopedBluefruitUserCallback& operator=(const ScopedBluefruitUserCallback&) = delete;

  static bool active() { return depth() != 0U; }

 private:
  static uint8_t& depth() {
    static uint8_t value = 0U;
    return value;
  }
};

template <typename Callback, typename... Args>
void invokeBluefruitUserCallback(Callback callback, Args... args) {
  if (callback == nullptr) {
    return;
  }
  ScopedBluefruitUserCallback scope;
  callback(args...);
}

bool timeReachedUs(uint64_t now, uint64_t target) {
  return static_cast<int64_t>(now - target) >= 0;
}

uint8_t gapAddressTypeForRandomAddress(const uint8_t address[6]) {
  if (address == nullptr) {
    return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
  }
  const uint8_t topBits = static_cast<uint8_t>(address[5] & 0xC0U);
  if (topBits == 0x40U) {
    return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
  }
  if (topBits == 0x00U) {
    return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
  }
  return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
}

bool isNonZeroAddress(const uint8_t address[6]) {
  if (address == nullptr) {
    return false;
  }
  for (uint8_t i = 0U; i < 6U; ++i) {
    if (address[i] != 0U) {
      return true;
    }
  }
  return false;
}

void copyBondAddressToGapAddress(const uint8_t address[6], bool random,
                                 ble_gap_addr_t* outAddress) {
  if (address == nullptr || outAddress == nullptr) {
    return;
  }
  memcpy(outAddress->addr, address, sizeof(outAddress->addr));
  outAddress->addr_type =
      random ? gapAddressTypeForRandomAddress(address) : BLE_GAP_ADDR_TYPE_PUBLIC;
}

uint8_t bluefruitAddressTypeFromHal(xiao_nrf54l15::BleAddressType type,
                                    const uint8_t address[6]) {
  (void)address;
  switch (type) {
    case xiao_nrf54l15::BleAddressType::kRandomStatic:
      return BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
    case xiao_nrf54l15::BleAddressType::kRandomPrivateResolvable:
      return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
    case xiao_nrf54l15::BleAddressType::kRandomPrivateNonResolvable:
      return BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
    case xiao_nrf54l15::BleAddressType::kPublic:
    default:
      return BLE_GAP_ADDR_TYPE_PUBLIC;
  }
}

xiao_nrf54l15::BleAddressType halAddressTypeFromBluefruit(uint8_t type) {
  switch (type) {
    case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
      return xiao_nrf54l15::BleAddressType::kRandomStatic;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
      return xiao_nrf54l15::BleAddressType::kRandomPrivateResolvable;
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
      return xiao_nrf54l15::BleAddressType::kRandomPrivateNonResolvable;
    case BLE_GAP_ADDR_TYPE_PUBLIC:
    default:
      return xiao_nrf54l15::BleAddressType::kPublic;
  }
}

unsigned long schedulerTimeMs() {
  return static_cast<unsigned long>(nrf54l15_core_monotonic_time_ms());
}

uint64_t schedulerTimeUs() { return nrf54l15_core_monotonic_time_us(); }

uint16_t byteSwap16(uint16_t value) {
  return static_cast<uint16_t>((value >> 8U) | (value << 8U));
}

bool uuidMatches(const BLEUuid& uuid, const uint8_t* data, uint8_t dataLen) {
  if (data == nullptr) {
    return false;
  }
  if (uuid.size() == 2U && dataLen == 2U) {
    return uuid.uuid16() == readLe16(data);
  }
  if (uuid.size() == 16U && dataLen == 16U) {
    if (memcmp(uuid.uuid128(), data, 16U) == 0) {
      return true;
    }
    const uint8_t* expected = uuid.uuid128();
    for (uint8_t i = 0U; i < 16U; ++i) {
      if (expected[i] != data[15U - i]) {
        return false;
      }
    }
    return true;
  }
  return false;
}

bool adDataHasUuid(const uint8_t* data, uint16_t len, const BLEUuid& uuid) {
  if (data == nullptr || len == 0U || !uuid.begin()) {
    return false;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }

    const uint8_t type = data[offset + 1U];
    const uint8_t valueLen = static_cast<uint8_t>(fieldLen - 1U);
    const uint8_t* value = &data[offset + 2U];
    if ((type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE ||
         type == BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE) &&
        uuid.size() == 2U) {
      for (uint8_t pos = 0U; (pos + 2U) <= valueLen; pos = static_cast<uint8_t>(pos + 2U)) {
        if (uuidMatches(uuid, &value[pos], 2U)) {
          return true;
        }
      }
    }
    if ((type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE ||
         type == BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_COMPLETE) &&
        uuid.size() == 16U) {
      for (uint8_t pos = 0U; (pos + 16U) <= valueLen;
           pos = static_cast<uint8_t>(pos + 16U)) {
        if (uuidMatches(uuid, &value[pos], 16U)) {
          return true;
        }
      }
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return false;
}

bool adDataHasMsdCompany(const uint8_t* data, uint16_t len, uint16_t companyId) {
  if (data == nullptr || len == 0U) {
    return false;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }
    const uint8_t type = data[offset + 1U];
    if (type == BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA && fieldLen >= 3U &&
        readLe16(&data[offset + 2U]) == companyId) {
      return true;
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return false;
}

int copyAdFieldByType(const uint8_t* data, uint16_t len, uint8_t type,
                      void* buffer, uint8_t bufferLen) {
  if (data == nullptr || buffer == nullptr || bufferLen == 0U) {
    return 0;
  }

  uint16_t offset = 0U;
  while (offset < len) {
    const uint8_t fieldLen = data[offset];
    if (fieldLen == 0U || static_cast<uint16_t>(offset + fieldLen) >= (len + 1U)) {
      break;
    }
    const uint8_t fieldType = data[offset + 1U];
    if (fieldType == type) {
      const uint8_t valueLen = static_cast<uint8_t>(fieldLen - 1U);
      const uint8_t copyLen = min<uint8_t>(valueLen, bufferLen);
      memcpy(buffer, &data[offset + 2U], copyLen);
      return copyLen;
    }
    offset = static_cast<uint16_t>(offset + fieldLen + 1U);
  }
  return 0;
}

