lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
int hexDigitValue(char c) {
  if (c >= '0' && c <= '9') {
    return c - '0';
  }
  if (c >= 'a' && c <= 'f') {
    return 10 + (c - 'a');
  }
  if (c >= 'A' && c <= 'F') {
    return 10 + (c - 'A');
  }
  return -1;
}

bool parseUuidString(const char* str, uint8_t outUuid[16], uint8_t* outSize,
                     uint16_t* outUuid16) {
  if (str == nullptr || outSize == nullptr || outUuid16 == nullptr) {
    return false;
  }

  const size_t len = strlen(str);
  if (len == 4U) {
    char* end = nullptr;
    const unsigned long value = strtoul(str, &end, 16);
    if (end == nullptr || *end != '\0' || value > 0xFFFFUL) {
      return false;
    }
    *outSize = 2U;
    *outUuid16 = static_cast<uint16_t>(value);
    return true;
  }

  char hex[32] = {0};
  size_t used = 0U;
  for (size_t i = 0U; i < len; ++i) {
    const char c = str[i];
    if (c == '-') {
      continue;
    }
    if (hexDigitValue(c) < 0 || used >= sizeof(hex)) {
      return false;
    }
    hex[used++] = c;
  }
  if (used != 32U) {
    return false;
  }

  uint8_t bigEndian[16] = {0};
  for (size_t i = 0U; i < 16U; ++i) {
    const int hi = hexDigitValue(hex[i * 2U]);
    const int lo = hexDigitValue(hex[i * 2U + 1U]);
    if (hi < 0 || lo < 0) {
      return false;
    }
    bigEndian[i] = static_cast<uint8_t>((hi << 4) | lo);
  }
  for (size_t i = 0U; i < 16U; ++i) {
    outUuid[i] = bigEndian[15U - i];
  }
  *outSize = 16U;
  *outUuid16 = 0U;
  return true;
}

void bleUuid128ToCanonical(const uint8_t littleEndian[16],
                           uint8_t canonical[16]) {
  if (littleEndian == nullptr || canonical == nullptr) {
    return;
  }
  for (size_t i = 0U; i < 16U; ++i) {
    canonical[i] = littleEndian[15U - i];
  }
}

uint8_t mapProperties(uint8_t properties) {
  uint8_t mapped = 0U;
  if ((properties & CHR_PROPS_READ) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropRead;
  }
  if ((properties & CHR_PROPS_WRITE_WO_RESP) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropWriteNoRsp;
  }
  if ((properties & CHR_PROPS_WRITE) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropWrite;
  }
  if ((properties & CHR_PROPS_NOTIFY) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropNotify;
  }
  if ((properties & CHR_PROPS_INDICATE) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropIndicate;
  }
  if ((properties & CHR_PROPS_AUTH_SIGNED_WRITES) != 0U) {
    mapped |= xiao_nrf54l15::kBleGattPropAuthenticatedSignedWrites;
  }
  return mapped;
}

static uint16_t preferredBleDataLengthFromMtu(uint16_t mtu_max);

uint8_t disconnectReasonToHci(const BleDisconnectDebug& debug) {
  switch (static_cast<BleDisconnectReason>(debug.reason)) {
    case BleDisconnectReason::kApi:
      return BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION;
    case BleDisconnectReason::kSupervisionTimeout:
      return BLE_HCI_CONNECTION_TIMEOUT;
    case BleDisconnectReason::kPeerTerminate:
      return (debug.errorCode != 0U) ? debug.errorCode
                                     : BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
    case BleDisconnectReason::kMicFailure:
      return BLE_HCI_CONNECTION_TERMINATED_DUE_TO_MIC_FAILURE;
    case BleDisconnectReason::kInternalTerminate:
      return (debug.errorCode != 0U) ? debug.errorCode
                                     : BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
    case BleDisconnectReason::kNone:
    default:
      return BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
  }
}

bool disconnectDebugRemoteTerminated(const BleDisconnectDebug& debug) {
  return static_cast<BleDisconnectReason>(debug.reason) ==
         BleDisconnectReason::kPeerTerminate;
}

const char* disconnectReasonNameFromHci(uint8_t reason) {
  switch (reason) {
    case BLE_HCI_STATUS_CODE_SUCCESS:
      return "success";
    case BLE_HCI_CONNECTION_TIMEOUT:
      return "connection timeout";
    case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
      return "remote user terminated";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_LOW_RESOURCES:
      return "remote low resources";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_POWER_OFF:
      return "remote power off";
    case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
      return "local host terminated";
    case BLE_HCI_CONNECTION_TERMINATED_DUE_TO_MIC_FAILURE:
      return "MIC failure";
    case BLE_HCI_CONNECTION_FAILED_TO_BE_ESTABLISHED:
      return "connection failed";
    default:
      return "unknown";
  }
}

class BluefruitCompatManager {
 public:
  static constexpr uint32_t kBleActiveIdleSleepCapUs = 1000UL;
  static constexpr unsigned long kBleNoWfiDuringSetupMs = 2000UL;
  static constexpr uint32_t kBleIdleConnectionPollBudgetUs = 0UL;
  static constexpr uint32_t kBleScannerPrewarmLeadUs = 650UL;
  static constexpr uint32_t kBleScannerReadyLeadUs = 80UL;

  BluefruitCompatManager()
      : started_(false),
        last_connected_(false),
        last_connection_role_(BleConnectionRole::kNone),
        last_connection_edge_ms_(0UL),
        next_adv_due_us_(0U),
        armed_adv_wake_us_(0U),
        next_scan_due_us_(0U),
        armed_scan_wake_us_(0U),
        scan_start_last_us_(0U),
        scan_prewarm_active_(false),
        adv_random_state_(0U),
        adv_started_ms_(0UL),
        scan_rsp_name_added_(false),
        characteristic_count_(0U),
        client_service_count_(0U),
        client_characteristic_count_(0U),
        scan_report_data_{},
        scan_report_len_(0U),
        scan_report_channel_valid_(false),
        scan_report_channel_(BleAdvertisingChannel::k37),
        pending_connect_valid_(false),
        pending_connect_channel_valid_(false),
        pending_connect_channel_(BleAdvertisingChannel::k37),
        pending_connect_report_us_(0U),
        pending_connect_random_(0U),
        client_sync_procedure_depth_(0U),
        central_data_length_request_pending_(false),
        central_mtu_request_pending_(false),
        central_explicit_data_length_request_(false),
        central_explicit_mtu_request_valid_(false),
        central_explicit_requested_mtu_(kDefaultAttMtu),
        deferred_connection_phy_request_pending_(false),
        deferred_connection_data_length_request_pending_(false),
        deferred_connection_mtu_request_pending_(false),
        deferred_connection_requested_phy_(BLE_GAP_PHY_AUTO),
        deferred_connection_requested_mtu_(kDefaultAttMtu),
        deferred_connection_phy_next_ms_(0UL),
        deferred_connection_data_length_next_ms_(0UL),
        deferred_connection_mtu_next_ms_(0UL),
        deferred_connection_phy_attempts_(0U),
        deferred_connection_data_length_attempts_(0U),
        deferred_connection_mtu_attempts_(0U),
        central_connect_callback_pending_(false),
        central_connect_callback_not_before_ms_(0UL),
        central_link_config_not_before_ms_(0UL),
        last_connect_attempt_ms_(0UL),
        rssi_monitor_enabled_(false),
        rssi_monitor_threshold_(0xFFU),
        last_reported_rssi_dbm_(0),
        last_reported_rssi_valid_(false),
        security_pairing_in_progress_(false),
        security_secured_callback_pending_(false),
        security_secured_callback_fired_(false),
        security_seen_procedure_active_(false),
        security_last_encrypted_(false),
        security_secured_callback_timeout_ms_(0UL),
        deferred_client_notification_head_(0U),
        deferred_client_notification_tail_(0U),
        deferred_client_notification_count_(0U) {
    memset(characteristics_, 0, sizeof(characteristics_));
    memset(client_services_, 0, sizeof(client_services_));
    memset(client_characteristics_, 0, sizeof(client_characteristics_));
    memset(&scan_report_, 0, sizeof(scan_report_));
    memset(pending_connect_address_, 0, sizeof(pending_connect_address_));
  }

  bool begin(uint8_t prph_count, uint8_t central_count) {
    (void)prph_count;
    (void)central_count;
    if (started_) {
      return true;
    }

