lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientService(BLEClientService* service) {
    if (service == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_service_count_; ++i) {
      if (client_services_[i] == service) {
        return true;
      }
    }
    if (client_service_count_ >= kMaxClientServices) {
      return false;
    }
    client_services_[client_service_count_++] = service;
    return true;
  }

  void resetClientDiscoveryState() {
    clearDeferredClientNotifications();
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] != nullptr) {
        client_characteristics_[i]->resetDiscovery();
      }
    }
    for (uint8_t i = 0U; i < client_service_count_; ++i) {
      if (client_services_[i] != nullptr) {
        client_services_[i]->resetDiscovery();
      }
    }
    for (uint8_t i = 0U; i < BLEClientUart::instance_count_; ++i) {
      BLEClientUart* uart = BLEClientUart::instances_[i];
      if (uart != nullptr) {
        uart->discovered_ = false;
        uart->rx_head_ = 0U;
        uart->rx_tail_ = 0U;
        uart->rx_count_ = 0U;
      }
    }
  }

  bool enqueueDeferredClientNotification(BLEClientCharacteristic* characteristic,
                                         const uint8_t* data, uint16_t len) {
    if (characteristic == nullptr || (data == nullptr && len != 0U) ||
        deferred_client_notification_count_ >=
            kDeferredClientNotificationQueueDepth) {
      return false;
    }

    DeferredClientNotification& notification =
        deferred_client_notifications_[deferred_client_notification_head_];
    notification.characteristic = characteristic;
    notification.len = min<uint16_t>(len, sizeof(notification.data));
    if (notification.len > 0U) {
      memcpy(notification.data, data, notification.len);
    }
    deferred_client_notification_head_ = static_cast<uint8_t>(
        (deferred_client_notification_head_ + 1U) %
        kDeferredClientNotificationQueueDepth);
    ++deferred_client_notification_count_;
    return true;
  }

  void clearDeferredClientNotifications(
      BLEClientCharacteristic* characteristic = nullptr) {
    uint8_t retained = 0U;
    for (uint8_t i = 0U; i < deferred_client_notification_count_; ++i) {
      const uint8_t sourceIndex = static_cast<uint8_t>(
          (deferred_client_notification_tail_ + i) %
          kDeferredClientNotificationQueueDepth);
      if (characteristic == nullptr ||
          deferred_client_notifications_[sourceIndex].characteristic ==
              characteristic) {
        continue;
      }
      const uint8_t destinationIndex = static_cast<uint8_t>(
          (deferred_client_notification_tail_ + retained) %
          kDeferredClientNotificationQueueDepth);
      if (destinationIndex != sourceIndex) {
        deferred_client_notifications_[destinationIndex] =
            deferred_client_notifications_[sourceIndex];
      }
      ++retained;
    }
    deferred_client_notification_count_ = retained;
    deferred_client_notification_head_ = static_cast<uint8_t>(
        (deferred_client_notification_tail_ + retained) %
        kDeferredClientNotificationQueueDepth);
  }

  void markAdvertisingDirty() {
    Bluefruit.Advertising.dirty_ = true;
    Bluefruit.ScanResponse.dirty_ = true;
  }

  void advertisingStarted() {
    adv_started_ms_ = schedulerTimeMs();
    next_adv_due_us_ = 0U;
    nrf54l15_ble_idle_wake_cancel();
    armed_adv_wake_us_ = 0U;
    nrf54l15_ble_background_radio_release();
    adv_random_state_ = 0U;
  }

  BLEConnection* connection() { return &connection_; }

  bool startRssiMonitor(uint8_t threshold) {
    if (!radio_.isConnected()) {
      return false;
    }
    rssi_monitor_enabled_ = true;
    rssi_monitor_threshold_ = threshold;
    last_reported_rssi_valid_ = radio_.getLatestConnectionRssiDbm(&last_reported_rssi_dbm_);
    return true;
  }

  int8_t currentConnectionRssi() const {
    int8_t rssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&rssiDbm)) {
      return 0;
    }
    return rssiDbm;
  }

  bool queueCentralConnect(const ble_gap_evt_adv_report_t* report) {
    if (report == nullptr) {
      return false;
    }
    memcpy(pending_connect_address_, report->peer_addr.addr, sizeof(pending_connect_address_));
    pending_connect_channel_valid_ = scan_report_channel_valid_;
    if (pending_connect_channel_valid_) {
      pending_connect_channel_ = scan_report_channel_;
    }
    pending_connect_report_us_ = schedulerTimeUs();
    pending_connect_random_ =
        (report->peer_addr.addr_type != BLE_GAP_ADDR_TYPE_PUBLIC) ? 1U : 0U;
    pending_connect_valid_ = true;
    Bluefruit.Scanner.paused_ = true;
    return maybeConnectCentral();
  }

  void handleClientConnectionEvent(const BleConnectionEvent& event) {
    if (!(event.packetReceived && event.crcOk && event.packetIsNew &&
          event.attPacket && event.payload != nullptr &&
          event.payloadLength >= 7U)) {
      return;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode != kAttOpHandleValueNtf &&
        attOpcode != kAttOpHandleValueInd) {
      return;
    }
    if (attOpcode == kAttOpHandleValueInd &&
        radio_.connectionRole() == BleConnectionRole::kPeripheral) {
      const uint8_t confirmation = kAttOpHandleValueCfm;
      (void)radio_.queueAttRequest(&confirmation, sizeof(confirmation));
    }

