lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  uint32_t centralConnectBudgetUs() const {
    const uint32_t intervalUs = scannerIntervalUs();
    const uint32_t windowUs = scannerWindowUs(intervalUs);
    uint32_t budgetUs = windowUs;
    if (budgetUs < kCentralConnectMinBudgetUs) {
      budgetUs = kCentralConnectMinBudgetUs;
    } else if (budgetUs > kCentralConnectMaxBudgetUs) {
      budgetUs = kCentralConnectMaxBudgetUs;
    }
    return budgetUs;
  }

  BleRadio radio_;
  bool started_;
  bool last_connected_;
  BleConnectionRole last_connection_role_;
  unsigned long last_connection_edge_ms_;
  uint64_t next_adv_due_us_;
  uint64_t armed_adv_wake_us_;
  uint64_t next_scan_due_us_;
  uint64_t armed_scan_wake_us_;
  uint64_t scan_start_last_us_;
  bool scan_prewarm_active_;
  uint32_t adv_random_state_;
  unsigned long adv_started_ms_;
  bool scan_rsp_name_added_;
  BLECharacteristic* characteristics_[kMaxCharacteristics];
  uint8_t characteristic_count_;
  BLEClientService* client_services_[kMaxClientServices];
  uint8_t client_service_count_;
  BLEClientCharacteristic* client_characteristics_[kMaxClientCharacteristics];
  uint8_t client_characteristic_count_;
  BLEConnection connection_;
  ble_gap_evt_adv_report_t scan_report_;
  uint8_t scan_report_data_[31];
  uint8_t scan_report_len_;
  bool scan_report_channel_valid_;
  BleAdvertisingChannel scan_report_channel_;
  bool pending_connect_valid_;
  uint8_t pending_connect_address_[6];
  bool pending_connect_channel_valid_;
  BleAdvertisingChannel pending_connect_channel_;
  uint64_t pending_connect_report_us_;
  uint8_t pending_connect_random_;
  uint8_t client_sync_procedure_depth_;
  bool central_data_length_request_pending_;
  bool central_mtu_request_pending_;
  bool central_explicit_data_length_request_;
  bool central_explicit_mtu_request_valid_;
  uint16_t central_explicit_requested_mtu_;
  bool deferred_connection_phy_request_pending_;
  bool deferred_connection_data_length_request_pending_;
  bool deferred_connection_mtu_request_pending_;
  uint8_t deferred_connection_requested_phy_;
  uint16_t deferred_connection_requested_mtu_;
  unsigned long deferred_connection_phy_next_ms_;
  unsigned long deferred_connection_data_length_next_ms_;
  unsigned long deferred_connection_mtu_next_ms_;
  uint8_t deferred_connection_phy_attempts_;
  uint8_t deferred_connection_data_length_attempts_;
  uint8_t deferred_connection_mtu_attempts_;
  bool central_connect_callback_pending_;
  unsigned long central_connect_callback_not_before_ms_;
  unsigned long central_link_config_not_before_ms_;
  unsigned long last_connect_attempt_ms_;
  bool rssi_monitor_enabled_;
  uint8_t rssi_monitor_threshold_;
  int8_t last_reported_rssi_dbm_;
  bool last_reported_rssi_valid_;
  bool security_pairing_in_progress_;
  bool security_secured_callback_pending_;
  bool security_secured_callback_fired_;
  bool security_seen_procedure_active_;
  bool security_last_encrypted_;
  unsigned long security_secured_callback_timeout_ms_;
  DeferredClientNotification deferred_client_notifications_[
      kDeferredClientNotificationQueueDepth];
  uint8_t deferred_client_notification_head_;
  uint8_t deferred_client_notification_tail_;
  uint8_t deferred_client_notification_count_;

  static void gattWriteThunk(uint16_t valueHandle, const uint8_t* value,
                             uint16_t valueLength, bool withResponse, void* context) {
    (void)withResponse;
    auto* self = static_cast<BluefruitCompatManager*>(context);
    if (self != nullptr) {
      self->handleGattWrite(valueHandle, value, valueLength);
    }
  }

  void handleGattWrite(uint16_t valueHandle, const uint8_t* value, uint16_t valueLength) {
    for (uint8_t i = 0U; i < characteristic_count_; ++i) {
      BLECharacteristic* characteristic = characteristics_[i];
      if (characteristic == nullptr) {
        continue;
      }
      if (characteristic->_handles.value_handle == valueHandle) {
        characteristic->handleWriteFromRadio(value, valueLength);
        return;
      }
    }
  }

  static void fillReportType(uint8_t pduHeader, ble_gap_adv_report_type_t* outType) {
    if (outType == nullptr) {
      return;
    }
    memset(outType, 0, sizeof(*outType));
    switch (pduHeader & 0x0FU) {
      case 0x00U:
        outType->connectable = 1U;
        outType->scannable = 1U;
        break;
      case 0x01U:
        outType->connectable = 1U;
        outType->directed = 1U;
        break;
      case 0x02U:
        break;
      case 0x04U:
        outType->scan_response = 1U;
        break;
      case 0x06U:
        outType->scannable = 1U;
        break;
      default:
        break;
    }
  }

  bool buildScanReport(const xiao_nrf54l15::BleScanPacket& packet) {
    if (packet.payload == nullptr || packet.length < 6U) {
      scan_report_channel_valid_ = false;
      return false;
    }
    scan_report_channel_valid_ = isPrimaryAdvertisingChannel(packet.channel);
    if (scan_report_channel_valid_) {
      scan_report_channel_ = packet.channel;
    }
    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, packet.payload, 6U);
    scan_report_.peer_addr.addr_type =
        ((packet.pduHeader >> 6U) & 0x1U)
            ? gapAddressTypeForRandomAddress(packet.payload)
            : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = packet.rssiDbm;
    fillReportType(packet.pduHeader, &scan_report_.type);

    scan_report_len_ = static_cast<uint8_t>(packet.length - 6U);
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U) {
      memcpy(scan_report_data_, &packet.payload[6], scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    return true;
  }

  bool buildScanReport(const xiao_nrf54l15::BleActiveScanResult& result) {
    return buildScanReport(result, false);
  }

  bool buildScanReport(const xiao_nrf54l15::BleActiveScanResult& result,
                       bool scanResponse) {
    if (scanResponse) {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagBuildScanRspCalled;
    } else {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagBuildAdvCalled;
    }
    const uint8_t* payload = nullptr;
    uint8_t payloadLength = 0U;
    uint8_t pduHeader = 0U;
    int8_t rssiDbm = -127;

    if (scanResponse) {
      if (!result.scanResponseReceived || result.scanRspPayloadLength < 6U) {
        scan_report_channel_valid_ = false;
        return false;
      }
      payload = result.scanRspPayload;
      payloadLength = result.scanRspPayloadLength;
      pduHeader = result.scanRspHeader;
      rssiDbm = result.scanRspRssiDbm;
    } else {
      if (result.advPayloadLength < 6U) {
        scan_report_channel_valid_ = false;
        return false;
      }
      payload = result.advPayload;
      payloadLength = result.advPayloadLength;
      pduHeader = result.advHeader;
      rssiDbm = result.advRssiDbm;
    }

    scan_report_channel_valid_ = isPrimaryAdvertisingChannel(result.channel);
    if (scan_report_channel_valid_) {
      scan_report_channel_ = result.channel;
    }
    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, payload, 6U);
    scan_report_.peer_addr.addr_type =
        ((pduHeader >> 6U) & 0x1U)
            ? gapAddressTypeForRandomAddress(payload)
            : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = rssiDbm;
    fillReportType(pduHeader, &scan_report_.type);

    scan_report_len_ = static_cast<uint8_t>(payloadLength - 6U);
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U) {
      memcpy(scan_report_data_, &payload[6], scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    g_bluefruitBleScanDiagLastReportLen = scan_report_len_;
    if (scan_report_len_ > 0U) {
      memcpy(const_cast<uint8_t*>(g_bluefruitBleScanDiagLastReportData),
             scan_report_data_, scan_report_len_);
    }
    if (scan_report_len_ < sizeof(g_bluefruitBleScanDiagLastReportData)) {
      memset(const_cast<uint8_t*>(&g_bluefruitBleScanDiagLastReportData[scan_report_len_]),
             0, sizeof(g_bluefruitBleScanDiagLastReportData) - scan_report_len_);
    }
    if (scanResponse) {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagBuildScanRspSuccess;
    } else {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagBuildAdvSuccess;
    }
    return true;
  }

  bool currentReportMatchesFilters() const {
    if (Bluefruit.Scanner.has_filter_rssi_ &&
        scan_report_.rssi < Bluefruit.Scanner.filter_rssi_dbm_) {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagFilterRssiFail;
      return false;
    }
    g_bluefruitBleScanDiagUuidSize = Bluefruit.Scanner.filter_uuid_.size();
    if (Bluefruit.Scanner.has_filter_uuid_ &&
        !adDataHasUuid(scan_report_.data.p_data, scan_report_.data.len,
                       Bluefruit.Scanner.filter_uuid_)) {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagFilterUuidFail;
      return false;
    }
    if (Bluefruit.Scanner.has_filter_msd_ &&
        !adDataHasMsdCompany(scan_report_.data.p_data, scan_report_.data.len,
                             Bluefruit.Scanner.filter_msd_company_)) {
      g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagFilterMsdFail;
      return false;
    }
    return true;
  }

  bool dispatchCurrentScanReport() {
    if (!currentReportMatchesFilters()) {
      return false;
    }

    g_bluefruitBleScanDiagFlags |= kBluefruitBleScanDiagDispatchSuccess;
    ++g_bluefruitBleIdleDiagDispatchCount;
    Bluefruit.Scanner.paused_ = true;
    invokeBluefruitUserCallback(Bluefruit.Scanner.rx_callback_, &scan_report_);
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
    }
    return true;
  }

  bool maybeConnectCentral() {
    if (!pending_connect_valid_) {
      return false;
    }
    ++g_bluefruitBleIdleDiagConnectAttempts;
    const uint64_t nowUs = schedulerTimeUs();
    updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStagePendingConnect,
                              0U);
    if ((pending_connect_report_us_ != 0U) &&
        ((nowUs - pending_connect_report_us_) > kCentralConnectCandidateMaxAgeUs)) {
      pending_connect_valid_ = false;
      pending_connect_channel_valid_ = false;
      pending_connect_report_us_ = 0U;
      if (Bluefruit.Scanner.running_) {
        Bluefruit.Scanner.paused_ = false;
        resetScannerSchedule();
      }
      return false;
    }
    last_connect_attempt_ms_ = millis();
    uint16_t interval_units = Bluefruit.central_conn_interval_;
    if (interval_units < 6U) {
      interval_units = 6U;
    } else if (interval_units > 3200U) {
      interval_units = 3200U;
    }
    uint16_t supervision_timeout_units = Bluefruit.central_supervision_timeout_;
    if (supervision_timeout_units < 10U) {
      supervision_timeout_units = 10U;
    } else if (supervision_timeout_units > 3200U) {
      supervision_timeout_units = 3200U;
    }
    const uint32_t connectBudgetUs = centralConnectBudgetUs();
    if (!radio_.initiateConnectionBudgeted(
            pending_connect_address_, pending_connect_random_ != 0U,
            interval_units, supervision_timeout_units, 9U, connectBudgetUs,
            pending_connect_channel_valid_
                ? pending_connect_channel_
                : static_cast<BleAdvertisingChannel>(0U))) {
      pending_connect_valid_ = false;
      pending_connect_channel_valid_ = false;
      pending_connect_report_us_ = 0U;
      if (Bluefruit.Scanner.running_) {
        Bluefruit.Scanner.paused_ = false;
        resetScannerSchedule();
      }
      return false;
    }
    pending_connect_valid_ = false;
    pending_connect_channel_valid_ = false;
    pending_connect_report_us_ = 0U;
    return true;
  }

  void maybeScanOrConnect() {
    ++g_bluefruitBleIdleDiagMaybeScanCalls;
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
      return;
    }
    if (!Bluefruit.Scanner.running_ || Bluefruit.Scanner.paused_ ||
        Bluefruit.Scanner.rx_callback_ == nullptr) {
      updateBleIdleDiagSnapshot(schedulerTimeUs(),
                                kBluefruitBleIdleDiagStageIdleDisabled, 0U);
      if (scan_prewarm_active_ && !radio_.isConnected()) {
        radio_.endForegroundUnconnectedRadioActivity();
        scan_prewarm_active_ = false;
      }
      nrf54l15_ble_idle_wake_cancel();
      armed_scan_wake_us_ = 0U;
      next_scan_due_us_ = 0U;
      return;
    }

    const uint64_t nowUs = schedulerTimeUs();
    if (next_scan_due_us_ == 0U) {
      next_scan_due_us_ = nowUs;
    }
    if (!timeReachedUs(nowUs, next_scan_due_us_)) {
      const uint64_t remainingUs64 = next_scan_due_us_ - nowUs;
      const uint32_t remainingUs =
          (remainingUs64 > 0xFFFFFFFFULL)
              ? 0xFFFFFFFFUL
              : static_cast<uint32_t>(remainingUs64);
      // A valid prewarm window is only the last few hundred microseconds
      // before the next scan slot. If prewarm is still latched while the
      // next scan is much farther out, release HFXO/RF ownership and re-arm
      // the wake compare instead of holding the unconnected radio path up for
      // the whole rest interval.
      if (scan_prewarm_active_ &&
          remainingUs > kBleScannerPrewarmLeadUs) {
        radio_.endForegroundUnconnectedRadioActivity();
        scan_prewarm_active_ = false;
      }
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanSleeping,
                                remainingUs);
      const uint32_t scanWakeUs =
          (remainingUs > kBleScannerPrewarmLeadUs)
              ? static_cast<uint32_t>(next_scan_due_us_ -
                                      static_cast<uint64_t>(kBleScannerPrewarmLeadUs))
              : static_cast<uint32_t>(next_scan_due_us_);
      if (!scan_prewarm_active_) {
        if (armed_scan_wake_us_ != scanWakeUs) {
          nrf54l15_ble_idle_wake_arm(scanWakeUs);
          armed_scan_wake_us_ = scanWakeUs;
        }
        if (nrf54l15_ble_idle_wake_consume() != 0U &&
            radio_.beginForegroundUnconnectedRadioActivity(0U)) {
          scan_prewarm_active_ = true;
          g_bluefruitBleIdleDiagLastPrewarmStartRemainingUs = remainingUs;
          g_bluefruitBleIdleDiagLastPrewarmSource = 1U;
          armed_scan_wake_us_ = 0U;
        }
      } else if (armed_scan_wake_us_ != 0U) {
        nrf54l15_ble_idle_wake_cancel();
        armed_scan_wake_us_ = 0U;
      }
      if (!scan_prewarm_active_ &&
          remainingUs <= kBleScannerPrewarmLeadUs &&
          radio_.beginForegroundUnconnectedRadioActivity(0U)) {
        scan_prewarm_active_ = true;
        g_bluefruitBleIdleDiagLastPrewarmStartRemainingUs = remainingUs;
        g_bluefruitBleIdleDiagLastPrewarmSource = 2U;
        nrf54l15_ble_idle_wake_cancel();
        armed_scan_wake_us_ = 0U;
      }
      return;
    }
    if (armed_scan_wake_us_ != 0U) {
      nrf54l15_ble_idle_wake_cancel();
      armed_scan_wake_us_ = 0U;
    }
    scan_prewarm_active_ = false;

