lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLESecurity::bondAuthenticated() const {
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record)) {
    return false;
  }
  return (record.reserved[0] & 0x01U) != 0U;
}

bool BLESecurity::getBondPeerAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record)) {
    return false;
  }
  copyBondAddressToGapAddress(record.peerAddress,
                              (record.peerAddressRandom & 0x01U) != 0U,
                              outAddress);
  return true;
}

bool BLESecurity::getBondPeerIdentityAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record) ||
      !isNonZeroAddress(record.peerIdentityAddress)) {
    return false;
  }
  copyBondAddressToGapAddress(
      record.peerIdentityAddress,
      (record.peerIdentityAddressRandom & 0x01U) != 0U, outAddress);
  return true;
}

bool BLESecurity::getBondPeerIrk(uint8_t outIrk[16]) const {
  if (outIrk == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleBondRecord record{};
  if (!manager().radio().getBondRecord(&record) || record.peerIrkValid == 0U) {
    return false;
  }
  memcpy(outIrk, record.peerIrk, sizeof(record.peerIrk));
  return true;
}

bool BLESecurity::getLocalIdentityAddress(ble_gap_addr_t* outAddress) const {
  if (outAddress == nullptr) {
    return false;
  }
  xiao_nrf54l15::BleAddressType type =
      xiao_nrf54l15::BleAddressType::kPublic;
  if (!manager().radio().getLocalIdentityAddress(outAddress->addr, &type)) {
    return false;
  }
  outAddress->addr_type =
      bluefruitAddressTypeFromHal(type, outAddress->addr);
  return true;
}

bool BLESecurity::getLocalIdentityRoot(uint8_t root[16]) const {
  if (root == nullptr) return false;
  xiao_nrf54l15::Ficr::identityRoot(root);
  return true;
}

bool BLESecurity::getLocalIdentityIrk(uint8_t irk[16]) const {
  return manager().radio().getLocalIdentityIrk(irk);
}

bool BLESecurity::setPrivacyEnabled(bool enabled, uint32_t intervalMs,
                                    bool rotateNow) {
  if (manager().radio().isConnected()) {
    return false;
  }
  if (!enabled) {
    if (!manager().radio().restoreLocalIdentityAddress()) {
      return false;
    }
    removeAutoBondedPeerResolvingIrk();
    auto_bonded_peer_resolving_ = false;
    return true;
  }

  uint8_t irk[16] = {};
  if (!getLocalIdentityIrk(irk) ||
      !manager().radio().enableResolvablePrivateAddressRotation(
          irk, intervalMs, rotateNow)) {
    return false;
  }
  auto_bonded_peer_resolving_ = true;
  (void)refreshBondedPeerResolving();
  return true;
}

bool BLESecurity::privacyEnabled() const {
  return manager().radio().isResolvablePrivateAddressRotationEnabled();
}

bool BLESecurity::generateResolvablePrivateAddress(const uint8_t irk[16],
                                                   uint8_t addressOut[6]) const {
  return manager().radio().generateResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::setResolvablePrivateAddress(const uint8_t irk[16],
                                              uint8_t addressOut[6]) const {
  return manager().radio().setResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    uint32_t intervalMs, bool rotateNow, uint8_t addressOut[6]) const {
  uint8_t irk[16] = {};
  if (!getLocalIdentityIrk(irk)) {
    return false;
  }
  return enableResolvablePrivateAddressRotation(irk, intervalMs, rotateNow,
                                                addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    const uint8_t irk[16], uint32_t intervalMs, bool rotateNow,
    uint8_t addressOut[6]) const {
  return manager().radio().enableResolvablePrivateAddressRotation(
      irk, intervalMs, rotateNow, addressOut);
}

void BLESecurity::disableResolvablePrivateAddressRotation() const {
  manager().radio().disableResolvablePrivateAddressRotation();
}

bool BLESecurity::serviceResolvablePrivateAddressRotation(
    uint8_t addressOut[6]) const {
  return manager().radio().serviceResolvablePrivateAddressRotation(addressOut);
}

bool BLESecurity::resolvablePrivateAddressRotationEnabled() const {
  return manager().radio().isResolvablePrivateAddressRotationEnabled();
}

bool BLESecurity::resolveResolvablePrivateAddress(const uint8_t address[6],
                                                  const uint8_t* irks,
                                                  size_t irkCount,
                                                  bool* outResolved,
                                                  uint16_t* outIndex) const {
  return manager().radio().resolveResolvablePrivateAddress(address, irks,
                                                           irkCount,
                                                           outResolved,
                                                           outIndex);
}

void BLESecurity::clearResolvingList() {
  resolving_list_count_ = 0U;
  memset(resolving_list_irks_, 0, sizeof(resolving_list_irks_));
  auto_bonded_peer_irk_owned_ = false;
  memset(auto_bonded_peer_irk_, 0, sizeof(auto_bonded_peer_irk_));
}

uint8_t BLESecurity::resolvingListCount() const {
  return resolving_list_count_;
}

uint8_t BLESecurity::resolvingListCapacity() const {
  return kResolvingListMaxEntries;
}

bool BLESecurity::addResolvingIrk(const uint8_t irk[16]) {
  if (irk == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < resolving_list_count_; ++i) {
    if (memcmp(resolving_list_irks_[i], irk, 16U) == 0) {
      return true;
    }
  }

  if (resolving_list_count_ >= kResolvingListMaxEntries) {
    return false;
  }

  memcpy(resolving_list_irks_[resolving_list_count_], irk, 16U);
  ++resolving_list_count_;
  return true;
}

bool BLESecurity::addBondedPeerIrkToResolvingList() {
  uint8_t irk[16] = {0};
  if (!getBondPeerIrk(irk)) {
    return false;
  }
  return addResolvingIrk(irk);
}

bool BLESecurity::setBondedPeerResolvingEnabled(bool enabled) {
  if (!enabled) {
    removeAutoBondedPeerResolvingIrk();
  }
  auto_bonded_peer_resolving_ = enabled;
  if (!enabled) {
    return true;
  }
  (void)refreshBondedPeerResolving();
  return true;
}

