lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  return false;
}

bool nextClientEvent(BleConnectionEvent* event, uint32_t timeoutMs = 800UL) {
  if (event == nullptr) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (manager().radio().consumeDeferredConnectionEvent(event)) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }
    if (manager().radio().pollConnectionEvent(event, 120000UL)) {
      return true;
    }
  }
  return false;
}

template <typename QueueAttempt>
bool queueClientAttProcedure(QueueAttempt queueAttempt,
                             uint32_t timeoutMs = 1000UL) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (queueAttempt()) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }

    BleConnectionEvent event{};
    if (!nextClientEvent(&event, 24UL)) {
      yield();
      continue;
    }

    if (event.terminateInd) {
      return false;
    }
    manager().handleClientConnectionEvent(event);
  }

  return false;
}

AttWaitResult waitForAttOpcode(uint8_t requestOpcode, uint8_t responseOpcode,
                               uint32_t timeoutMs = 1000UL) {
  AttWaitResult result{};
  result.outcome = AttWaitOutcome::kTimeout;
  result.errorCode = 0U;

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    BleConnectionEvent event{};
    if (!nextClientEvent(&event, 120UL)) {
      if (!manager().radio().isConnected()) {
        result.outcome = AttWaitOutcome::kDisconnected;
        return result;
      }
      continue;
    }

    if (event.terminateInd) {
      result.outcome = AttWaitOutcome::kDisconnected;
      result.event = event;
      return result;
    }

    // The controller has already applied the LL ACK/NESN state. Do not expose
    // a retransmitted payload to ATT or let it satisfy a later same-opcode
    // request a second time.
    if (!event.packetIsNew) {
      continue;
    }

    if (!(event.packetReceived && event.crcOk && event.attPacket &&
          event.payload != nullptr && event.payloadLength >= 5U)) {
      manager().handleClientConnectionEvent(event);
      continue;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode == kAttOpHandleValueNtf ||
        attOpcode == kAttOpHandleValueInd) {
      manager().handleClientConnectionEvent(event);
      continue;
    }

    if (attOpcode == kAttOpErrorRsp && event.payloadLength >= 9U) {
      if (event.payload[5] == requestOpcode) {
        result.outcome = AttWaitOutcome::kError;
        result.event = event;
        result.errorCode = event.payload[8];
        return result;
      }
      manager().handleClientConnectionEvent(event);
      continue;
    }

    if (attOpcode == responseOpcode) {
      result.outcome = AttWaitOutcome::kResponse;
      result.event = event;
      return result;
    }

    manager().handleClientConnectionEvent(event);
  }

  return result;
}

bool queueServiceDiscoveryRequest(const BLEUuid& uuid, bool reverse128 = false) {
  if (uuid.size() == 2U) {
    uint8_t request[9] = {kAttOpFindByTypeValueReq, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    writeLe16(&request[7], uuid.uuid16());
    return queueClientAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  if (uuid.size() == 16U) {
    uint8_t request[23] = {0};
    request[0] = kAttOpFindByTypeValueReq;
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    for (uint8_t i = 0U; i < 16U; ++i) {
      request[7U + i] = reverse128 ? uuid.uuid128()[15U - i] : uuid.uuid128()[i];
    }
    return queueClientAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  return false;
}

bool discoverServiceRangeSync(const BLEUuid& uuid, uint16_t* startHandle,
                              uint16_t* endHandle) {
  ScopedClientSyncProcedure scopedProcedure;
  if (startHandle == nullptr || endHandle == nullptr) {
    return false;
  }
  if (uuid.size() != 16U) {
    if (!queueServiceDiscoveryRequest(uuid, false)) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        !validAttFixedListLayout(payloadLength, 5U, 4U)) {
      return false;
    }

    uint16_t firstStart = 0U;
    uint16_t firstEnd = 0U;
    uint16_t previousEnd = 0U;
    for (uint16_t offset = 5U; offset + 4U <= payloadLength; offset += 4U) {
      const uint16_t candidateStart = readLe16(&wait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&wait.event.payload[offset + 2U]);
      if (!validAttServiceGroupEntry(candidateStart, candidateEnd, 1U,
                                     0xFFFFU, previousEnd)) {
        return false;
      }
      if (firstStart == 0U) {
        firstStart = candidateStart;
        firstEnd = candidateEnd;
      }
      previousEnd = candidateEnd;
    }
    *startHandle = firstStart;
    *endHandle = firstEnd;
    return true;
  }

  {
    // A 128-bit Find By Type Value request is 23 ATT bytes, which becomes a
    // full 27-byte default LL data PDU before MTU/Data Length negotiation.
    // Walking primary services via Read By Group Type avoids that edge while
    // still discovering the same service range.
  }

  uint16_t searchStart = 0x0001U;
  while (true) {
    uint8_t request[7] = {kAttOpReadByGroupTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

