lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    const AttWaitResult groupWait =
        waitForAttOpcode(kAttOpReadByGroupTypeReq, kAttOpReadByGroupTypeRsp);
    if (groupWait.outcome == AttWaitOutcome::kError &&
        groupWait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    const uint16_t payloadLength = groupWait.event.payloadLength;
    if (groupWait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

    const uint8_t entryLen = groupWait.event.payload[5];
    if (!validAttDiscoveryListLayout(payloadLength, entryLen, 6U, 20U)) {
      return false;
    }

    uint16_t lastEndHandle = static_cast<uint16_t>(searchStart - 1U);
    for (uint16_t offset = kAttDiscoveryListPrefixLength;
         offset + entryLen <= payloadLength; offset += entryLen) {
      const uint16_t candidateStart = readLe16(&groupWait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&groupWait.event.payload[offset + 2U]);
      if (!validAttServiceGroupEntry(candidateStart, candidateEnd, searchStart,
                                     0xFFFFU, lastEndHandle)) {
        return false;
      }
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 4U);
      const uint8_t* candidateUuid = &groupWait.event.payload[offset + 4U];
      lastEndHandle = candidateEnd;
      if (uuidMatches(uuid, candidateUuid, uuidLen)) {
        *startHandle = candidateStart;
        *endHandle = candidateEnd;
        return true;
      }
    }

    if (lastEndHandle == 0xFFFFU) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastEndHandle + 1U);
  }

  return false;
}

bool discoverCharacteristicSync(uint16_t serviceStartHandle, uint16_t serviceEndHandle,
                                const BLEUuid& uuid, uint16_t* declHandle,
                                uint16_t* valueHandle, uint16_t* endHandle,
                                uint8_t* properties) {
  ScopedClientSyncProcedure scopedProcedure;
  if (declHandle == nullptr || valueHandle == nullptr || endHandle == nullptr ||
      serviceStartHandle == 0U || serviceEndHandle == 0U) {
    return false;
  }

  bool found = false;
  uint16_t searchStart = serviceStartHandle;
  uint16_t previousValueHandle = static_cast<uint16_t>(searchStart - 1U);
  *declHandle = 0U;
  *valueHandle = 0U;
  *endHandle = 0U;
  if (properties != nullptr) {
    *properties = 0U;
  }

  while (searchStart <= serviceEndHandle) {
    uint8_t request[7] = {kAttOpReadByTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], serviceEndHandle);
    writeLe16(&request[5], kUuidCharacteristic);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpReadByTypeReq, kAttOpReadByTypeRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      break;
    }
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

    const uint8_t entryLen = wait.event.payload[5];
    if (!validAttDiscoveryListLayout(payloadLength, entryLen, 7U, 21U)) {
      return false;
    }

    uint16_t lastDecl = static_cast<uint16_t>(searchStart - 1U);
    for (uint16_t offset = kAttDiscoveryListPrefixLength;
         offset + entryLen <= payloadLength; offset += entryLen) {
      const uint16_t candidateDecl = readLe16(&wait.event.payload[offset]);
      const uint8_t candidateProperties = wait.event.payload[offset + 2U];
      const uint16_t candidateValue = readLe16(&wait.event.payload[offset + 3U]);
      if (!validAttCharacteristicEntry(candidateDecl, candidateValue,
                                       searchStart, serviceEndHandle,
                                       previousValueHandle)) {
        return false;
      }
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 5U);
      const uint8_t* candidateUuid = &wait.event.payload[offset + 5U];

      if (found && candidateDecl > *declHandle) {
        *endHandle = static_cast<uint16_t>(candidateDecl - 1U);
        return true;
      }

      if (!found && uuidMatches(uuid, candidateUuid, uuidLen)) {
        found = true;
        *declHandle = candidateDecl;
        *valueHandle = candidateValue;
        *endHandle = serviceEndHandle;
        if (properties != nullptr) {
          *properties = candidateProperties;
        }
      }

      lastDecl = candidateDecl;
      previousValueHandle = candidateValue;
    }

    if (lastDecl >= serviceEndHandle) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastDecl + 1U);
  }

  return found;
}

bool discoverCccdHandleSync(uint16_t valueHandle, uint16_t endHandle, uint16_t* cccdHandle) {
  ScopedClientSyncProcedure scopedProcedure;
  if (cccdHandle == nullptr || valueHandle == 0U || endHandle <= valueHandle) {
    return false;
  }

  uint16_t searchStart = static_cast<uint16_t>(valueHandle + 1U);
  while (searchStart <= endHandle) {
    uint8_t request[5] = {kAttOpFindInfoReq, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], endHandle);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait = waitForAttOpcode(kAttOpFindInfoReq, kAttOpFindInfoRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

    const uint8_t format = wait.event.payload[5];
    const uint8_t entryLen = (format == 0x01U) ? 4U : 18U;
    if ((format != 0x01U && format != 0x02U) ||
        !validAttDiscoveryListLayout(payloadLength, entryLen, 4U, 18U)) {
      return false;
    }
    uint16_t lastHandle = static_cast<uint16_t>(searchStart - 1U);
    if (format == 0x01U) {
      for (uint16_t offset = kAttDiscoveryListPrefixLength;
           offset + entryLen <= payloadLength; offset += entryLen) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        if (!validAttOrderedHandle(handle, searchStart, endHandle,
                                   lastHandle)) {
          return false;
        }
        lastHandle = handle;
        const uint16_t uuid16 = readLe16(&wait.event.payload[offset + 2U]);
        if (uuid16 == kUuidClientCharacteristicConfig) {
          *cccdHandle = handle;
          return true;
        }
      }
    } else {
      for (uint16_t offset = kAttDiscoveryListPrefixLength;
           offset + entryLen <= payloadLength; offset += entryLen) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        if (!validAttOrderedHandle(handle, searchStart, endHandle,
                                   lastHandle)) {
          return false;
        }
        lastHandle = handle;
      }
    }

    if (lastHandle >= endHandle) {
      return false;
    }
    searchStart = static_cast<uint16_t>(lastHandle + 1U);
  }

