lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  return false;
}

bool discoverReportReferenceHandleSync(uint16_t valueHandle, uint16_t endHandle,
                                       uint16_t* reportReferenceHandle) {
  ScopedClientSyncProcedure scopedProcedure;
  if (reportReferenceHandle == nullptr || valueHandle == 0U ||
      endHandle <= valueHandle) {
    return false;
  }

  uint16_t searchStart = static_cast<uint16_t>(valueHandle + 1U);
  while (searchStart <= endHandle) {
    uint8_t request[5] = {kAttOpFindInfoReq, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], endHandle);
    if (!queueClientAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait = waitForAttOpcode(kAttOpFindInfoReq, kAttOpFindInfoRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    const uint16_t payloadLength = wait.event.payloadLength;
    if (wait.outcome != AttWaitOutcome::kResponse ||
        payloadLength < kAttDiscoveryListPrefixLength) {
      return false;
    }

    const uint8_t format = wait.event.payload[5];
    const uint8_t entryLen = (format == 0x01U) ? 4U : 18U;
    if ((format != 0x01U && format != 0x02U) ||
        !validAttDiscoveryListLayout(payloadLength, entryLen, 4U, 18U)) {
      return false;
    }
    uint16_t lastHandle = static_cast<uint16_t>(searchStart - 1U);
    if (format == 0x01U) {
      for (uint16_t offset = kAttDiscoveryListPrefixLength;
           offset + entryLen <= payloadLength; offset += entryLen) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        if (!validAttOrderedHandle(handle, searchStart, endHandle,
                                   lastHandle)) {
          return false;
        }
        lastHandle = handle;
        const uint16_t uuid16 = readLe16(&wait.event.payload[offset + 2U]);
        if (uuid16 == kUuidReportReference) {
          *reportReferenceHandle = handle;
          return true;
        }
      }
    } else {
      for (uint16_t offset = kAttDiscoveryListPrefixLength;
           offset + entryLen <= payloadLength; offset += entryLen) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        if (!validAttOrderedHandle(handle, searchStart, endHandle,
                                   lastHandle)) {
          return false;
        }
        lastHandle = handle;
      }
    }

    if (lastHandle >= endHandle) {
      return false;
    }
    searchStart = static_cast<uint16_t>(lastHandle + 1U);
  }

  return false;
}

uint16_t readHandleSync(uint16_t handle, uint8_t* buffer, uint16_t bufferLen) {
  ScopedClientSyncProcedure scopedProcedure;
  if (handle == 0U || buffer == nullptr || bufferLen == 0U) {
    return 0U;
  }

  uint16_t copied = 0U;
  bool firstRequest = true;
  while (copied < bufferLen) {
    const uint8_t requestOpcode = firstRequest ? kAttOpReadReq : kAttOpReadBlobReq;
    const uint8_t responseOpcode = firstRequest ? kAttOpReadRsp : kAttOpReadBlobRsp;
    bool queued = false;
    if (firstRequest) {
      queued = queueClientAttProcedure(
          [&]() { return manager().radio().queueAttReadRequest(handle); });
    } else {
      uint8_t request[5] = {kAttOpReadBlobReq, 0U, 0U, 0U, 0U};
      writeLe16(&request[1], handle);
      writeLe16(&request[3], copied);
      queued = queueClientAttProcedure(
          [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
    }
    if (!queued) {
      return 0U;
    }

    const AttWaitResult wait = waitForAttOpcode(requestOpcode, responseOpcode);
    if (wait.outcome == AttWaitOutcome::kError && !firstRequest && copied > 0U &&
        (wait.errorCode == kAttErrInvalidOffset ||
         wait.errorCode == kAttErrAttributeNotLong)) {
      return copied;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 5U) {
      return 0U;
    }

    const uint16_t fragmentLen =
        static_cast<uint16_t>(wait.event.payloadLength - 5U);
    const uint16_t remaining = static_cast<uint16_t>(bufferLen - copied);
    const uint16_t copyLen = min<uint16_t>(remaining, fragmentLen);
    if (copyLen > 0U) {
      memcpy(&buffer[copied], &wait.event.payload[5], copyLen);
      copied = static_cast<uint16_t>(copied + copyLen);
    }
    if (copyLen < fragmentLen || copied == bufferLen || fragmentLen == 0U) {
      return copied;
    }

    const uint16_t attMtu = manager().radio().currentAttMtu();
    const uint16_t dataLength = manager().radio().currentDataLength();
    const uint16_t attCapacity = (attMtu > 1U) ? (attMtu - 1U) : 0U;
    const uint16_t dataCapacity = (dataLength > 5U) ? (dataLength - 5U) : 0U;
    const uint16_t responseCapacity = min<uint16_t>(attCapacity, dataCapacity);
    if (responseCapacity == 0U || fragmentLen < responseCapacity) {
      return copied;
    }
    firstRequest = false;
  }
  return copied;
}

bool writeHandleSync(uint16_t handle, const uint8_t* data, uint8_t dataLen,
                     bool withResponse = true) {
  ScopedClientSyncProcedure scopedProcedure;
  if (!queueClientAttProcedure([&]() {
        return manager().radio().queueAttWriteRequest(handle, data, dataLen, withResponse);
      })) {
    return false;
  }
  if (!withResponse) {
    return true;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpWriteReq, kAttOpWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool executePreparedWriteSync(bool execute) {
  if (!queueClientAttProcedure([&]() {
        return manager().radio().queueAttExecuteWriteRequest(execute);
      })) {
    return false;
  }

  const AttWaitResult wait =
      waitForAttOpcode(kAttOpExecuteWriteReq, kAttOpExecuteWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool writeLongHandleSync(uint16_t handle, const uint8_t* data, uint16_t dataLen) {
  ScopedClientSyncProcedure scopedProcedure;
  g_bluefruitLongWriteDiagCode = 0U;
  g_bluefruitLongWriteDiagSent = 0U;
  g_bluefruitLongWriteDiagChunk = 0U;
  g_bluefruitLongWriteDiagMtu = manager().radio().currentAttMtu();
  g_bluefruitLongWriteDiagDataLength = manager().radio().currentDataLength();
  g_bluefruitLongWriteDiagWaitOutcome = 0U;
  g_bluefruitLongWriteDiagAttError = 0U;
  g_bluefruitLongWriteDiagEventLength = 0U;
  g_bluefruitLongWriteDiagEventOpcode = 0U;
  if (handle == 0U || data == nullptr || dataLen == 0U ||
      dataLen > BleRadio::kCustomGattMaxValueLength) {
    g_bluefruitLongWriteDiagCode = 1U;
    return false;
  }

