lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEScanner::filterService(const BLEUuid& uuid) { filterUuid(uuid); }

void BLEScanner::filterService(const BLEClientService& service) { filterUuid(service.uuid); }

void BLEScanner::filterMSD(uint16_t company_id) {
  filter_msd_company_ = company_id;
  has_filter_msd_ = true;
}

void BLEScanner::filterRssi(int8_t min_rssi_dbm) {
  filter_rssi_dbm_ = min_rssi_dbm;
  has_filter_rssi_ = true;
}

void BLEScanner::start(uint16_t timeout) {
  if (!manager().begin(0U, 1U)) {
    return;
  }
  manager().resetScannerSchedule();
  timeout_s_ = timeout;
  started_ms_ = millis();
  running_ = true;
  paused_ = false;
}

bool BLEScanner::stop() {
  return manager().stopScanner();
}

void BLEScanner::resume() {
  if (manager().radio().isConnected()) {
    paused_ = true;
    return;
  }
  paused_ = false;
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const BLEUuid& uuid) const {
  return report != nullptr && adDataHasUuid(report->data.p_data, report->data.len, uuid);
}

bool BLEScanner::checkReportForUuid(const ble_gap_evt_adv_report_t* report,
                                    const uint8_t uuid128[16]) const {
  return (uuid128 != nullptr) && checkReportForUuid(report, BLEUuid(uuid128));
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEUuid& uuid) const {
  return checkReportForUuid(report, uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientService& service) const {
  return checkReportForService(report, service.uuid);
}

bool BLEScanner::checkReportForService(const ble_gap_evt_adv_report_t* report,
                                       const BLEClientUart& client_uart) const {
  return checkReportForService(report, client_uart.serviceUuid());
}

int BLEScanner::parseReportByType(const ble_gap_evt_adv_report_t* report, uint8_t type,
                                  void* buffer, uint8_t buffer_len) const {
  if (report == nullptr) {
    return 0;
  }
  return copyAdFieldByType(report->data.p_data, report->data.len, type, buffer, buffer_len);
}

BLEClientCharacteristic::BLEClientCharacteristic()
    : uuid(),
      begun_(false),
      discovered_(false),
      notify_callback_(nullptr),
      service_(nullptr),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      decl_handle_(0U),
      value_handle_(0U),
      end_handle_(0U),
      cccd_handle_(0U),
      properties_(0U),
      last_value_{0},
      last_value_len_(0U),
      notify_deferred_(true) {}

BLEClientCharacteristic::BLEClientCharacteristic(BLEUuid bleuuid)
    : BLEClientCharacteristic() {
  uuid = bleuuid;
}

bool BLEClientCharacteristic::begin() {
  return begin(nullptr);
}

bool BLEClientCharacteristic::begin(BLEClientService* parent_service) {
  if (begun_) {
    return true;
  }
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  service_ = (parent_service != nullptr) ? parent_service : BLEClientService::lastService;
  if (service_ == nullptr || !manager().registerClientCharacteristic(this)) {
    return false;
  }
  begun_ = true;
  return true;
}

BLEClientService& BLEClientCharacteristic::parentService() { return *service_; }

const BLEClientService& BLEClientCharacteristic::parentService() const { return *service_; }

void BLEClientCharacteristic::resetDiscovery() {
  manager().clearDeferredClientNotifications(this);
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  decl_handle_ = 0U;
  value_handle_ = 0U;
  end_handle_ = 0U;
  cccd_handle_ = 0U;
  properties_ = 0U;
  last_value_len_ = 0U;
  memset(last_value_, 0, sizeof(last_value_));
}

bool BLEClientCharacteristic::discover(uint16_t conn_hdl) {
  if (!begin() || service_ == nullptr || !service_->discover(conn_hdl)) {
    resetDiscovery();
    return false;
  }
  return discover();
}

bool BLEClientCharacteristic::discover() {
  if (!begin() || service_ == nullptr || !service_->discovered_) {
    resetDiscovery();
    return false;
  }

  resetDiscovery();
  if (!retryClientProcedure([&]() {
        return discoverCharacteristicSync(service_->start_handle_, service_->end_handle_,
                                          uuid, &decl_handle_, &value_handle_,
                                          &end_handle_, &properties_);
      })) {
    return false;
  }
  conn_handle_ = service_->conn_handle_;
  discovered_ = true;
  return true;
}

uint16_t BLEClientCharacteristic::read(void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  uint8_t* output = static_cast<uint8_t*>(buffer);
  const uint16_t readLen = readHandleSync(value_handle_, output, len);
  if (readLen == 0U) {
    return 0U;
  }
  last_value_len_ = min<uint16_t>(readLen, sizeof(last_value_));
  memcpy(last_value_, output, last_value_len_);
  return readLen;
}

uint8_t BLEClientCharacteristic::read8() {
  uint8_t value = 0U;
  (void)read(&value, sizeof(value));
  return value;
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len) {
  const bool supportsWrite =
      (properties_ & xiao_nrf54l15::kBleGattPropWrite) != 0U;
  const bool supportsWriteWithoutResponse =
      (properties_ & xiao_nrf54l15::kBleGattPropWriteNoRsp) != 0U;
  const bool withResponse = supportsWrite || !supportsWriteWithoutResponse;
  return write(buffer, len, withResponse);
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len,
                                        bool withResponse) {
  if (!discovered_ || buffer == nullptr || len == 0U ||
      len > BleRadio::kCustomGattMaxValueLength) {
    return 0U;
  }
  const bool singleWriteFits =
      (static_cast<uint16_t>(3U + len) <= manager().radio().currentAttMtu()) &&
      (static_cast<uint16_t>(7U + len) <= manager().radio().currentDataLength());
  if (withResponse && !singleWriteFits) {
    return writeLongHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len)
               ? len
               : 0U;
  }
  if (!waitForLinkValueCapacity(len)) {
    return 0U;
  }
  return writeHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len,
                         withResponse) ? len
                                       : 0U;
}

