lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  const size_t appIdLength = strlen(appid);
  const size_t commandLength = 1U + appIdLength + 1U + 1U;
  if (commandLength > BLUEFRUIT_GATT_VALUE_MAX_LEN) {
    return 0U;
  }

  uint8_t command[BLUEFRUIT_GATT_VALUE_MAX_LEN] = {0};
  command[0] = ANCS_CMD_GET_APP_ATTR;
  memcpy(&command[1], appid, appIdLength);
  command[1U + appIdLength] = 0U;
  command[commandLength - 1U] = attr;

  const uint16_t prefixLength = static_cast<uint16_t>(1U + appIdLength + 1U);
  beginAttributeResponse(command, prefixLength, attr, buffer, outputCapacity);
  if (control_.write(command, static_cast<uint16_t>(commandLength), true) !=
          commandLength ||
      !waitForAttributeResponse()) {
    static_cast<uint8_t*>(buffer)[response_.valueCopied] = 0U;
    cancelAttributeResponse();
    return 0U;
  }

  const uint16_t copied = response_.valueCopied;
  static_cast<uint8_t*>(buffer)[copied] = 0U;
  cancelAttributeResponse();
  return copied;
}

bool BLEAncs::performAction(uint32_t uid, uint8_t actionid) {
  if (!control_.discovered() || actionid > ANCS_ACTION_NEGATIVE) {
    return false;
  }
  uint8_t payload[6] = {ANCS_CMD_PERFORM_NOTIFICATION_ACTION,
                        static_cast<uint8_t>(uid & 0xFFU),
                        static_cast<uint8_t>((uid >> 8U) & 0xFFU),
                        static_cast<uint8_t>((uid >> 16U) & 0xFFU),
                        static_cast<uint8_t>((uid >> 24U) & 0xFFU), actionid};
  return control_.write(payload, sizeof(payload)) == sizeof(payload);
}

uint16_t BLEAncs::getAppName(uint32_t uid, void* buffer, uint16_t bufsize) {
  char appId[192] = {0};
  const uint16_t appIdLength = getAppID(uid, appId, sizeof(appId));
  if (appIdLength == 0U || appIdLength >= (sizeof(appId) - 1U)) {
    return 0U;
  }
  return getAppAttribute(appId, ANCS_APP_ATTR_DISPLAY_NAME, buffer, bufsize);
}

uint16_t BLEAncs::getAppID(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_APP_IDENTIFIER, buffer, bufsize);
}

uint16_t BLEAncs::getTitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_TITLE, buffer, bufsize);
}

uint16_t BLEAncs::getSubtitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_SUBTITLE, buffer, bufsize);
}

uint16_t BLEAncs::getMessage(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_MESSAGE, buffer, bufsize);
}

uint16_t BLEAncs::getMessageSize(uint32_t uid) {
  char value[20] = {0};
  if (getAttribute(uid, ANCS_ATTR_MESSAGE_SIZE, value, sizeof(value)) == 0U) {
    return 0U;
  }
  char* end = nullptr;
  const unsigned long parsed = strtoul(value, &end, 10);
  if (end == value || end == nullptr || *end != '\0') {
    return 0U;
  }
  return static_cast<uint16_t>(min<unsigned long>(parsed, 0xFFFFUL));
}

uint16_t BLEAncs::getDate(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_DATE, buffer, bufsize);
}

uint16_t BLEAncs::getPosActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_POSITIVE_ACTION_LABEL, buffer, bufsize);
}

uint16_t BLEAncs::getNegActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_NEGATIVE_ACTION_LABEL, buffer, bufsize);
}

bool BLEAncs::actPositive(uint32_t uid) { return performAction(uid, ANCS_ACTION_POSITIVE); }

bool BLEAncs::actNegative(uint32_t uid) { return performAction(uid, ANCS_ACTION_NEGATIVE); }

void BLEAncs::handleNotification(uint8_t* data, uint16_t len) {
  if (notification_callback_ == nullptr || data == nullptr ||
      len != sizeof(AncsNotification_t)) {
    return;
  }
  AncsNotification_t notification{};
  memcpy(&notification, data, sizeof(notification));
  if (notification.eventID > ANCS_EVT_NOTIFICATION_REMOVED ||
      notification.categoryID > ANCS_CAT_ENTERTAINMENT) {
    return;
  }
  invokeBluefruitUserCallback(notification_callback_, &notification);
}

void BLEAncs::notificationThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEAncs&>(chr->parentService()).handleNotification(data, len);
}

void BLEAncs::beginAttributeResponse(const uint8_t* expectedPrefix,
                                     uint16_t expectedPrefixLen,
                                     uint8_t requestedAttribute, void* buffer,
                                     uint16_t bufferSize) {
  response_.begin(expectedPrefix, expectedPrefixLen, requestedAttribute, buffer,
                  bufferSize);
}

void BLEAncs::cancelAttributeResponse() { response_.cancel(); }

bool BLEAncs::waitForAttributeResponse(uint32_t timeoutMs) {
  const unsigned long startedAtMs = millis();
  while (response_.active && !response_.complete && !response_.failed &&
         manager().radio().isConnected() &&
         (millis() - startedAtMs) < timeoutMs) {
    BleConnectionEvent event{};
    if (!nextClientEvent(&event, 120UL)) {
      yield();
      continue;
    }
    if (event.terminateInd) {
      response_.failed = true;
      break;
    }
    manager().handleClientConnectionEvent(event);
  }
  return response_.complete && !response_.failed;
}

void BLEAncs::handleData(uint8_t* data, uint16_t len) {
  response_.feed(data, len);
}

void BLEAncs::dataThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEAncs&>(chr->parentService()).handleData(data, len);
}

BLEClientHidAdafruit::BLEClientHidAdafruit()
    : BLEClientService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      keyboard_callback_(nullptr),
      mouse_callback_(nullptr),
      gamepad_callback_(nullptr),
      last_keyboard_report_{},
      last_mouse_report_{},
      last_gamepad_report_{},
      keyboard_led_state_(0U),
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      keyboard_boot_input_(UUID16_CHR_BOOT_KEYBOARD_INPUT_REPORT),
      keyboard_boot_output_(UUID16_CHR_BOOT_KEYBOARD_OUTPUT_REPORT),
      mouse_boot_input_(UUID16_CHR_BOOT_MOUSE_INPUT_REPORT),
      gamepad_report_(UUID16_CHR_REPORT),
      generic_report_present_(false),
      gamepad_report_pending_(false) {}

