lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEClientHidAdafruit::begin() {
  keyboard_boot_input_.setNotifyCallback(keyboardNotifyThunk);
  mouse_boot_input_.setNotifyCallback(mouseNotifyThunk);
  gamepad_report_.setNotifyCallback(gamepadNotifyThunk);
  return BLEClientService::begin() && protocol_mode_.begin(this) && hid_info_.begin(this) &&
         hid_control_.begin(this) && keyboard_boot_input_.begin(this) &&
         keyboard_boot_output_.begin(this) && mouse_boot_input_.begin(this) &&
         gamepad_report_.begin(this);
}

bool BLEClientHidAdafruit::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  (void)protocol_mode_.discover();
  (void)hid_info_.discover();
  (void)hid_control_.discover();
  (void)keyboard_boot_input_.discover();
  (void)keyboard_boot_output_.discover();
  (void)mouse_boot_input_.discover();
  (void)discoverGamepadReport();
  return hid_info_.discovered() && hid_control_.discovered() &&
         (keyboardPresent() || mousePresent() || gamepad_report_.discovered() ||
          generic_report_present_);
}

bool BLEClientHidAdafruit::discoverGamepadReport() {
  gamepad_report_.resetDiscovery();
  generic_report_present_ = false;
  gamepad_report_pending_ = false;
  if (!discovered_) {
    return false;
  }

  const BLEUuid reportUuid(UUID16_CHR_REPORT);
  uint16_t searchStart = start_handle_;
  while (searchStart <= end_handle_) {
    uint16_t declarationHandle = 0U;
    uint16_t valueHandle = 0U;
    uint16_t characteristicEndHandle = 0U;
    uint8_t properties = 0U;
    if (!discoverCharacteristicSync(searchStart, end_handle_, reportUuid,
                                    &declarationHandle, &valueHandle,
                                    &characteristicEndHandle, &properties)) {
      break;
    }
    generic_report_present_ = true;

    uint16_t reportReferenceHandle = 0U;
    uint8_t reportReference[2] = {0U, 0U};
    const bool referenceRead =
        discoverReportReferenceHandleSync(valueHandle, characteristicEndHandle,
                                           &reportReferenceHandle) &&
        readHandleSync(reportReferenceHandle, reportReference,
                       sizeof(reportReference)) == sizeof(reportReference);
    if (!referenceRead) {
      gamepad_report_pending_ = true;
    } else {
      // This compatibility client handles keyboard and mouse through their
      // Boot characteristics. Report ID 1 is the Adafruit gamepad input only
      // when those Boot collections are absent; on the combined keyboard /
      // mouse service it is the keyboard Report characteristic.
      const bool gamepadReference = reportReference[0] == 1U &&
                                    reportReference[1] == 1U &&
                                    (properties & xiao_nrf54l15::kBleGattPropNotify) != 0U;
      if (gamepadReference && !keyboardPresent() && !mousePresent()) {
        gamepad_report_.discovered_ = true;
        gamepad_report_.service_ = this;
        gamepad_report_.conn_handle_ = conn_handle_;
        gamepad_report_.decl_handle_ = declarationHandle;
        gamepad_report_.value_handle_ = valueHandle;
        gamepad_report_.end_handle_ = characteristicEndHandle;
        gamepad_report_.cccd_handle_ = 0U;
        gamepad_report_.properties_ = properties;
        gamepad_report_pending_ = false;
        return true;
      }
    }

    if (characteristicEndHandle >= end_handle_) {
      break;
    }
    searchStart = static_cast<uint16_t>(characteristicEndHandle + 1U);
  }
  return false;
}

bool BLEClientHidAdafruit::getHidInfo(uint8_t info[4]) {
  return (info != nullptr) && (hid_info_.read(info, 4U) == 4U);
}

uint8_t BLEClientHidAdafruit::getCountryCode(void) {
  uint8_t info[4] = {0};
  return getHidInfo(info) ? info[2] : 0U;
}

bool BLEClientHidAdafruit::setBootMode(bool boot) {
  return protocol_mode_.discovered() && protocol_mode_.write8(boot ? 0U : 1U) == 1U;
}

bool BLEClientHidAdafruit::keyboardPresent(void) {
  return keyboard_boot_input_.discovered() && keyboard_boot_output_.discovered() &&
         protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableKeyboard(void) { return keyboard_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableKeyboard(void) { return keyboard_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getKeyboardReport(hid_keyboard_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_keyboard_report_, sizeof(last_keyboard_report_));
  }
}

bool BLEClientHidAdafruit::setKeyboardLedState(uint8_t leds_bitmap) {
  if (!keyboard_boot_output_.discovered()) {
    return false;
  }
  if (keyboard_boot_output_.write8(leds_bitmap) != 1U) {
    return false;
  }
  keyboard_led_state_ = leds_bitmap;
  return true;
}

uint8_t BLEClientHidAdafruit::keyboardLedState() const {
  return keyboard_led_state_;
}

bool BLEClientHidAdafruit::mousePresent(void) {
  return mouse_boot_input_.discovered() && protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableMouse(void) { return mouse_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableMouse(void) { return mouse_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getMouseReport(hid_mouse_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_mouse_report_, sizeof(last_mouse_report_));
  }
}

bool BLEClientHidAdafruit::gamepadPresent(void) {
  if (!gamepad_report_.discovered() && gamepad_report_pending_ &&
      Bluefruit.Security.isEncrypted(conn_handle_)) {
    (void)discoverGamepadReport();
  }
  return gamepad_report_.discovered();
}

bool BLEClientHidAdafruit::enableGamepad(void) {
  return gamepadPresent() && gamepad_report_.enableNotify();
}

bool BLEClientHidAdafruit::disableGamepad(void) {
  return gamepadPresent() && gamepad_report_.disableNotify();
}

void BLEClientHidAdafruit::getGamepadReport(hid_gamepad_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_gamepad_report_, sizeof(last_gamepad_report_));
  }
}

void BLEClientHidAdafruit::setKeyboardReportCallback(kbd_callback_t fp) {
  keyboard_callback_ = fp;
}

