lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool hidLinkEncrypted(uint16_t connHandle) {
  const uint16_t resolvedHandle =
      (connHandle == BLE_CONN_HANDLE_INVALID) ? 0U : connHandle;
  return Bluefruit.connected() &&
         Bluefruit.Security.isEncrypted(resolvedHandle);
}

}  // namespace

BLEHidAdafruit::BLEHidAdafruit()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      mouse_buttons_(0U),
      keyboard_led_state_(0U),
      keyboard_led_callback_(nullptr),
      protocol_mode_callback_(nullptr),
      report_protocol_mode_(true),
      zephyr_compatible_mouse_(false),
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      report_map_(UUID16_CHR_REPORT_MAP),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      keyboard_input_(UUID16_CHR_REPORT),
      keyboard_output_(UUID16_CHR_REPORT),
      boot_keyboard_input_(UUID16_CHR_BOOT_KEYBOARD_INPUT_REPORT),
      boot_keyboard_output_(UUID16_CHR_BOOT_KEYBOARD_OUTPUT_REPORT),
      mouse_input_(UUID16_CHR_REPORT),
      boot_mouse_input_(UUID16_CHR_BOOT_MOUSE_INPUT_REPORT),
      consumer_input_(UUID16_CHR_REPORT) {}

void BLEHidAdafruit::setZephyrCompatibleMouse(bool enabled) {
  zephyr_compatible_mouse_ = enabled;
}

err_t BLEHidAdafruit::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  report_protocol_mode_ = true;
  keyboard_led_state_ = 0U;

  if (zephyr_compatible_mouse_) {
    err_t result = beginFixedCharacteristic(
        hid_info_, CHR_PROPS_READ, SECMODE_OPEN, SECMODE_NO_ACCESS,
        kHidZephyrInfoValue, sizeof(kHidZephyrInfoValue));
    if (result != ERROR_NONE) {
      return result;
    }

    result = beginFixedCharacteristic(
        report_map_, CHR_PROPS_READ, SECMODE_OPEN, SECMODE_NO_ACCESS,
        kHidZephyrMouseReportMap, sizeof(kHidZephyrMouseReportMap));
    if (result != ERROR_NONE) {
      return result;
    }

    uint8_t emptyMouse[3] = {0U, 0U, 0U};
    mouse_input_.setReportRefDescriptor(kHidZephyrMouseReportId,
                                        kHidReportTypeInput);
    mouse_input_.setReportRefDescriptorPermission(SECMODE_OPEN);
    result = beginFixedCharacteristic(
        mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY, SECMODE_ENC_NO_MITM,
        SECMODE_NO_ACCESS, emptyMouse, sizeof(emptyMouse));
    if (result != ERROR_NONE) {
      return result;
    }

    uint8_t control = 0U;
    result = beginFixedCharacteristic(
        hid_control_, CHR_PROPS_WRITE_WO_RESP, SECMODE_NO_ACCESS,
        SECMODE_ENC_NO_MITM, &control, sizeof(control));
    if (result != ERROR_NONE) {
      return result;
    }

    Bluefruit.Periph.setConnInterval(24, 40);
    return ERROR_NONE;
  }

  const uint8_t protocol = kHidProtocolModeReport;
  protocol_mode_.setWriteCallback(protocolModeWriteThunk);
  err_t result =
      beginFixedCharacteristic(protocol_mode_, CHR_PROPS_READ | CHR_PROPS_WRITE_WO_RESP,
                               SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM,
                               &protocol, sizeof(protocol));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_info_.setProperties(CHR_PROPS_READ);
  result = beginFixedCharacteristic(hid_info_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidInfoValue,
                                    sizeof(kHidInfoValue));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(report_map_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidAdafruitReportMap,
                                    sizeof(kHidAdafruitReportMap));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_keyboard_report_t emptyKeyboard{};
  keyboard_input_.setReportRefDescriptor(kHidKeyboardReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(keyboard_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyKeyboard, sizeof(emptyKeyboard));
  if (result != ERROR_NONE) {
    return result;
  }

  keyboard_output_.setReportRefDescriptor(kHidKeyboardReportId, kHidReportTypeOutput);
  keyboard_output_.setWriteCallback(keyboard_led_callback_ ? keyboardOutputWriteThunk : nullptr);
  result = beginFixedCharacteristic(
      keyboard_output_, CHR_PROPS_READ | CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP,
      SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM, &keyboard_led_state_,
      sizeof(keyboard_led_state_));
  if (result != ERROR_NONE) {
    return result;
  }

  boot_keyboard_input_.setWriteCallback(nullptr);
  result = beginFixedCharacteristic(boot_keyboard_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyKeyboard, sizeof(emptyKeyboard));
  if (result != ERROR_NONE) {
    return result;
  }

  boot_keyboard_output_.setWriteCallback(keyboard_led_callback_ ? keyboardOutputWriteThunk
                                                                : nullptr);
  result = beginFixedCharacteristic(
      boot_keyboard_output_, CHR_PROPS_READ | CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP,
      SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM, &keyboard_led_state_,
      sizeof(keyboard_led_state_));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_mouse_report_t emptyMouse{};
  mouse_input_.setReportRefDescriptor(kHidMouseReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyMouse, sizeof(emptyMouse));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(boot_mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyMouse, sizeof(emptyMouse));
  if (result != ERROR_NONE) {
    return result;
  }

