lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  uint16_t emptyConsumer = 0U;
  consumer_input_.setReportRefDescriptor(kHidConsumerReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(consumer_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyConsumer, sizeof(emptyConsumer));
  if (result != ERROR_NONE) {
    return result;
  }

  uint8_t control = 0U;
  result = beginFixedCharacteristic(hid_control_, CHR_PROPS_WRITE_WO_RESP,
                                    SECMODE_NO_ACCESS, SECMODE_ENC_NO_MITM,
                                    &control, sizeof(control));
  if (result != ERROR_NONE) {
    return result;
  }

#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  Bluefruit.Periph.setConnInterval(24, 40);
#else
  Bluefruit.Periph.setConnInterval(9, 12);
#endif
  return ERROR_NONE;
}

void BLEHidAdafruit::setKeyboardLedCallback(kbd_led_cb_t fp) {
  keyboard_led_callback_ = fp;
  keyboard_output_.setWriteCallback(fp ? keyboardOutputWriteThunk : nullptr);
  boot_keyboard_output_.setWriteCallback(fp ? keyboardOutputWriteThunk : nullptr);
}

uint8_t BLEHidAdafruit::keyboardLedState() const {
  return keyboard_led_state_;
}

void BLEHidAdafruit::setProtocolModeCallback(protocol_mode_cb_t fp) {
  protocol_mode_callback_ = fp;
}

uint8_t BLEHidAdafruit::protocolMode() const {
  return report_protocol_mode_ ? BLE_HID_PROTOCOL_MODE_REPORT
                               : BLE_HID_PROTOCOL_MODE_BOOT;
}

bool BLEHidAdafruit::isBootProtocolMode() const {
  return protocolMode() == BLE_HID_PROTOCOL_MODE_BOOT;
}

bool BLEHidAdafruit::isReportProtocolMode() const {
  return protocolMode() == BLE_HID_PROTOCOL_MODE_REPORT;
}

void BLEHidAdafruit::handleKeyboardOutput(uint16_t conn_hdl, uint8_t* data, uint16_t len) {
  if (data != nullptr && len > 0U) {
    keyboard_led_state_ = data[0];
    if (keyboard_led_callback_ != nullptr) {
      invokeBluefruitUserCallback(keyboard_led_callback_, conn_hdl,
                                  keyboard_led_state_);
    }
  }
}

void BLEHidAdafruit::handleProtocolModeWrite(uint16_t conn_hdl, uint8_t* data,
                                             uint16_t len) {
  if (data != nullptr && len > 0U) {
    const uint8_t mode = (data[0] == kHidProtocolModeBoot)
                             ? BLE_HID_PROTOCOL_MODE_BOOT
                             : BLE_HID_PROTOCOL_MODE_REPORT;
    report_protocol_mode_ = (mode == BLE_HID_PROTOCOL_MODE_REPORT);
    if (protocol_mode_callback_ != nullptr) {
      invokeBluefruitUserCallback(protocol_mode_callback_, conn_hdl, mode);
    }
  }
}

void BLEHidAdafruit::keyboardOutputWriteThunk(uint16_t conn_hdl, BLECharacteristic* chr,
                                              uint8_t* data, uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEHidAdafruit&>(chr->parentService()).handleKeyboardOutput(conn_hdl, data, len);
  }
}

void BLEHidAdafruit::protocolModeWriteThunk(uint16_t conn_hdl, BLECharacteristic* chr,
                                            uint8_t* data, uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEHidAdafruit&>(chr->parentService())
        .handleProtocolModeWrite(conn_hdl, data, len);
  }
}

bool BLEHidAdafruit::keyboardReport(hid_keyboard_report_t* report) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidAdafruit::keyboardReport(uint8_t modifier, uint8_t keycode[6]) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, modifier, keycode);
}

bool BLEHidAdafruit::keyPress(char ch) { return keyPress(BLE_CONN_HANDLE_INVALID, ch); }

bool BLEHidAdafruit::keyRelease(void) { return keyRelease(BLE_CONN_HANDLE_INVALID); }

bool BLEHidAdafruit::keySequence(const char* str, int interval) {
  return keySequence(BLE_CONN_HANDLE_INVALID, str, interval);
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, hid_keyboard_report_t* report) {
  if (report == nullptr || !hidLinkEncrypted(conn_hdl)) {
    return false;
  }
  BLECharacteristic& reportCharacteristic =
      report_protocol_mode_ ? keyboard_input_ : boot_keyboard_input_;
  return reportCharacteristic.notify(conn_hdl, report, sizeof(*report));
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, uint8_t modifier, uint8_t keycode[6]) {
  hid_keyboard_report_t report{};
  report.modifier = modifier;
  if (keycode != nullptr) {
    memcpy(report.keycode, keycode, sizeof(report.keycode));
  }
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyPress(uint16_t conn_hdl, char ch) {
  const uint8_t ascii = static_cast<uint8_t>(ch);
  if (ascii >= 128U) {
    return false;
  }
  hid_keyboard_report_t report{};
  report.modifier = hid_ascii_to_keycode[ascii][0]
                        ? static_cast<uint8_t>(KEYBOARD_MODIFIER_LEFTSHIFT)
                        : 0U;
  report.keycode[0] = hid_ascii_to_keycode[ascii][1];
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyRelease(uint16_t conn_hdl) {
  hid_keyboard_report_t report{};
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keySequence(uint16_t conn_hdl, const char* str, int interval) {
  if (str == nullptr) {
    return false;
  }
  for (const char* cursor = str; *cursor != '\0'; ++cursor) {
    if (!keyPress(conn_hdl, *cursor)) {
      return false;
    }
    delay(interval);
    if (!keyRelease(conn_hdl)) {
      return false;
    }
    delay(interval);
  }
  return true;
}

bool BLEHidAdafruit::consumerReport(uint16_t usage_code) {
  return consumerReport(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t usage_code) {
  return consumerKeyPress(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(void) {
  return consumerKeyRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::consumerReport(uint16_t conn_hdl, uint16_t usage_code) {
  if (!hidLinkEncrypted(conn_hdl)) {
    return false;
  }
  return consumer_input_.notify(conn_hdl, &usage_code, sizeof(usage_code));
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t conn_hdl, uint16_t usage_code) {
  return consumerReport(conn_hdl, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(uint16_t conn_hdl) {
  return consumerReport(conn_hdl, 0U);
}

bool BLEHidAdafruit::mouseReport(hid_mouse_report_t* report) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, report);
}

